week8/d1_redit/redit_project/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SuLH1wmGPtug3G9veslf9g=="], ["updated_at", "2021-03-08 21:02:16.683026"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save!